/// status : true
/// code : 200
/// data : [{"id":2,"tag_id":1,"image":"posts/4-1629519400.jpg","title":"الطائف احلى","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:47:40.000000Z","youtube":null,"views":43,"location_lng":null,"location_lat":null,"phone":null},{"id":4,"tag_id":1,"image":"posts/4-1629519653.jpg","title":"تراث الطائف","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:35:31.000000Z","youtube":null,"views":22,"location_lng":null,"location_lat":null,"phone":null},{"id":5,"tag_id":1,"image":"posts/4-1629519239.jpg","title":"السحاب يعانق الطائف","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:35:33.000000Z","youtube":null,"views":18,"location_lng":null,"location_lat":null,"phone":null},{"id":6,"tag_id":1,"image":"posts/4-1629519327.jpg","title":"الورد الطائفي","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:35:42.000000Z","youtube":null,"views":17,"location_lng":null,"location_lat":null,"phone":null},{"id":13,"tag_id":1,"image":"posts/4-1629519168.jfif","title":"مدينة الطائف","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:35:38.000000Z","youtube":null,"views":21,"location_lng":null,"location_lat":null,"phone":null},{"id":14,"tag_id":1,"image":"posts/4-1629519731.jfif","title":"سوق عكاظ","content":"مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n","created_at":"2021-07-02T05:49:23.000000Z","updated_at":"2021-09-02T15:35:36.000000Z","youtube":null,"views":37,"location_lng":null,"location_lat":null,"phone":null}]

class TaifModel {
  bool? _status;
  int? _code;
  List<TaifData>? _data;

  bool? get status => _status;
  int? get code => _code;
  List<TaifData>? get data => _data;

  TaifModel({
      bool? status, 
      int? code, 
      List<TaifData>? data}){
    _status = status;
    _code = code;
    _data = data;
}

  TaifModel.fromJson(dynamic json) {
    _status = json['status'];
    _code = json['code'];
    if (json['data'] != null) {
      _data = [];
      json['data'].forEach((v) {
        _data?.add(TaifData.fromJson(v));
      });
    }
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map['status'] = _status;
    map['code'] = _code;
    if (_data != null) {
      map['data'] = _data?.map((v) => v.toJson()).toList();
    }
    return map;
  }

}

/// id : 2
/// tag_id : 1
/// image : "posts/4-1629519400.jpg"
/// title : "الطائف احلى"
/// content : "مدينة الطائف الطائف مدينةٌ عربيةٌ من مدن المملكة العربية السعودية، تعود بتأسيسها إلى ما قبل ميلاد سيدنا عيسى بن مريم عليهما السلام، وتقع جغرافياً في الجهة الغربية من المملكة العربية السعودية وتحديداً في مدينة مكة المكرمة، وتقع فلكياً بين خطي طول 40 درجةً إلى 42 درجةً شرق خط جرينتش، وبين دائرتي عرض 20 درجةً إلى 22 درجةً شمال خط الاستواء، وتبلغ مساحة أراضيها 87.561 كم² ، وتحتل المرتبة السادسة من بين مدن السعودية من حيث عدد السكان؛ إذ بلغ عدد سكانها 993.800 نسمة وذلك حسب إحصائيات عام 2014م، ويتحدث سكانها اللغة العربية التي تعتبر لغةً رسمية في السعودية، ويدين سكانها بالدين الإسلامي.[١] معلومات عن مدينة الطائف فيما يلي معلومات عن المدينة:[٢] يقام على أرضها سنوياً العديد من المهرجانات كمهرجان قطاف الورد الطائفي، ومهرجان الهدا، ومهرجان سباقات الهجن السنوية، ومهرجان صيف الطائف، ومهرجان الطائف الشتوي، ومهرجان ربيع البهيتة. تحدث عنها الإصطخري في كتابه بأنّها: الطائف مدينة أكثر ثمارها الزبيب، وهي طيبة الهواء، وأكثر فواكه مكة منها. تشتهر المدينة بأنّها أول مدينةٍ أقيم فيها تخطيطٌ هندسيٌ، وأول مدينةٍ يقصدها الرسول صلى الله عليه وسلم، وأول مدينة في السعودية هبطت فيها طائرة سعودية، وأول مدينةٍ بني فيها مدرسةٌ نظامية تهتمّ بالدراسات الإسلامية. يمتاز مناخها بأنّه باردٌ في فصل الشتاء، ومعتدل الحرارة في فصل الصيف. تمتلك الطائف محطاتٍ تاريخيةً متنوعة مرت عليها عبر العصور التاريخية، منها: عُقدت على أرضها معاهدة بين المملكة المتوكلية اليمنية والمملكة العربية السعودية وذلك في العام 1934م، وفيها أعلن عن نهاية الحرب السعودية اليمنية. أقيم فيها البطولة العربية لمنتخبات كرة القدم في العام 1986م، وقد استضافت البطولة العربية لألعاب القوى وكأس العالم للشباب في العام 1989م. شهدت المدينة جزءاً كبيراً من المؤتمر الإسلامي الذي عقد في محافظة مكة المكرمة في بداية عقد الثمانينات، وفي العام 1989م عقد فيها اتفاق صلحٍ بين جميع الفصائل اللبنانية في حرب لبنان عرفت باسم اتفاق الطائف.\r\n\r\n"
/// created_at : "2021-07-02T05:49:23.000000Z"
/// updated_at : "2021-09-02T15:47:40.000000Z"
/// youtube : null
/// views : 43
/// location_lng : null
/// location_lat : null
/// phone : null

class TaifData {
  double? km;
  int? id;
  int? tagId;
  String? image;
  String? title;
  String? content;
  String? createdAt;
  String? updatedAt;
  dynamic? youtube;
  int? views;
  dynamic? locationLng;
  dynamic? locationLat;
  dynamic? phone;
  List<Images>? images;



  TaifData({
      this.km,
this.content,
    this.image,
    this.id,
    this.phone,
    this.title,
    this.locationLng,
    this.locationLat,
    this.createdAt,
    this.views,
    this.tagId,
    this.updatedAt,
    this.youtube,
    this.images
  });

  TaifData.fromJson(dynamic json) {
    id = json['id'];
    tagId = json['tag_id'];
    image = json['image'];
    title = json['title'];
    content = json['content'];
    createdAt = json['created_at'];
    updatedAt = json['updated_at'];
    youtube = json['youtube'];
    views = json['views'];
    locationLng = json['location_lng'];
    locationLat = json['location_lat'];
    phone = json['phone'];
    if (json['images'] != null) {
      images = [];
      json['images'].forEach((v) {
        images?.add(Images.fromJson(v));
      });
    }
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map['id'] = id;
    map['tag_id'] = tagId;
    map['image'] = image;
    map['title'] = title;
    map['content'] = content;
    map['created_at'] = createdAt;
    map['updated_at'] = updatedAt;
    map['youtube'] = youtube;
    map['views'] = views;
    map['location_lng'] = locationLng;
    map['location_lat'] = locationLat;
    map['phone'] = phone;
    return map;
  }

}

class Images {
  int? _id;
  String? _path;
  String? _viewableType;
  int? _viewableId;
  String? _createdAt;
  String? _updatedAt;

  int? get id => _id;
  String? get path => _path;
  String? get viewableType => _viewableType;
  int? get viewableId => _viewableId;
  String? get createdAt => _createdAt;
  String? get updatedAt => _updatedAt;

  Images({
    int? id,
    String? path,
    String? viewableType,
    int? viewableId,
    String? createdAt,
    String? updatedAt}){
    _id = id;
    _path = path;
    _viewableType = viewableType;
    _viewableId = viewableId;
    _createdAt = createdAt;
    _updatedAt = updatedAt;
  }

  Images.fromJson(dynamic json) {
    _id = json['id'];
    _path = json['path'];
    _viewableType = json['viewable_type'];
    _viewableId = json['viewable_id'];
    _createdAt = json['created_at'];
    _updatedAt = json['updated_at'];
  }

  Map<String, dynamic> toJson() {
    var map = <String, dynamic>{};
    map['id'] = _id;
    map['path'] = _path;
    map['viewable_type'] = _viewableType;
    map['viewable_id'] = _viewableId;
    map['created_at'] = _createdAt;
    map['updated_at'] = _updatedAt;
    return map;
  }

}